{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "anime"}, "name": "anime", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "user"}, "name": "user", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "nn_anime_embedding", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4036, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "nn_anime_embedding", "inbound_nodes": [[["anime", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "nn_user_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1, "output_dim": 32, "embeddings_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "nn_user_embedding", "inbound_nodes": [[["user", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_4", "inbound_nodes": [[["nn_anime_embedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_5", "inbound_nodes": [[["nn_user_embedding", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_2", "inbound_nodes": [[["flatten_4", 0, 0, {}], ["flatten_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": false, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": false, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "mf_anime_embedding", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4036, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "mf_anime_embedding", "inbound_nodes": [[["anime", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "mf_user_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1, "output_dim": 16, "embeddings_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "mf_user_embedding", "inbound_nodes": [[["user", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": false, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_6", "inbound_nodes": [[["mf_anime_embedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_7", "inbound_nodes": [[["mf_user_embedding", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": false, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["flatten_6", 0, 0, {}], ["flatten_7", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_3", "inbound_nodes": [[["dense_8", 0, 0, {}], ["multiply_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": false, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}], "input_layers": [["anime", 0, 0], ["user", 0, 0]], "output_layers": [["dense_9", 0, 0]]}}, "training_config": {"loss": "mse", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.01, "decay": 0.0, "momentum": 0.0, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_5/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [16, 8], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [24, 1], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [1], "dtype": "float32"}, {"name": "mf_anime_embedding/embeddings", "shape": [4036, 16], "dtype": "float32"}, {"name": "mf_user_embedding/embeddings", "shape": [1, 16], "dtype": "float32"}, {"name": "nn_anime_embedding/embeddings", "shape": [4036, 32], "dtype": "float32"}, {"name": "nn_user_embedding/embeddings", "shape": [1, 32], "dtype": "float32"}]}]}